perfTest/stage5/get.txt
Running 10s test @ http://localhost:8080
  4 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.33ms    0.91ms  25.79ms   90.91%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.25ms
 75.000%    1.64ms
 90.000%    1.99ms
 99.000%    3.42ms
 99.900%   12.26ms
 99.990%   24.09ms
 99.999%   25.81ms
100.000%   25.81ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.098     0.000000            1         1.00
       0.629     0.100000          979         1.11
       0.821     0.200000         1961         1.25
       0.963     0.300000         2938         1.43
       1.103     0.400000         3914         1.67
       1.247     0.500000         4895         2.00
       1.321     0.550000         5378         2.22
       1.396     0.600000         5868         2.50
       1.480     0.650000         6359         2.86
       1.559     0.700000         6848         3.33
       1.642     0.750000         7335         4.00
       1.685     0.775000         7586         4.44
       1.730     0.800000         7825         5.00
       1.780     0.825000         8074         5.71
       1.839     0.850000         8312         6.67
       1.909     0.875000         8555         8.00
       1.944     0.887500         8678         8.89
       1.986     0.900000         8801        10.00
       2.039     0.912500         8923        11.43
       2.091     0.925000         9045        13.33
       2.165     0.937500         9168        16.00
       2.197     0.943750         9228        17.78
       2.251     0.950000         9292        20.00
       2.295     0.956250         9352        22.86
       2.359     0.962500         9413        26.67
       2.439     0.968750         9472        32.00
       2.505     0.971875         9504        35.56
       2.547     0.975000         9533        40.00
       2.613     0.978125         9564        45.71
       2.745     0.981250         9594        53.33
       2.911     0.984375         9625        64.00
       3.013     0.985938         9640        71.11
       3.153     0.987500         9655        80.00
       3.301     0.989062         9671        91.43
       3.503     0.990625         9686       106.67
       3.995     0.992188         9701       128.00
       4.243     0.992969         9709       142.22
       4.699     0.993750         9716       160.00
       5.071     0.994531         9724       182.86
       5.527     0.995313         9732       213.33
       6.019     0.996094         9739       256.00
       6.175     0.996484         9743       284.44
       6.271     0.996875         9747       320.00
       6.655     0.997266         9751       365.71
       7.015     0.997656         9755       426.67
       7.695     0.998047         9758       512.00
       8.263     0.998242         9760       568.89
       8.439     0.998437         9762       640.00
       9.463     0.998633         9764       731.43
      10.151     0.998828         9766       853.33
      13.799     0.999023         9768      1024.00
      16.943     0.999121         9769      1137.78
      17.039     0.999219         9770      1280.00
      18.415     0.999316         9771      1462.86
      19.215     0.999414         9772      1706.67
      20.895     0.999512         9773      2048.00
      20.895     0.999561         9773      2275.56
      21.999     0.999609         9774      2560.00
      21.999     0.999658         9774      2925.71
      22.687     0.999707         9775      3413.33
      22.687     0.999756         9775      4096.00
      22.687     0.999780         9775      4551.11
      24.095     0.999805         9776      5120.00
      24.095     0.999829         9776      5851.43
      24.095     0.999854         9776      6826.67
      24.095     0.999878         9776      8192.00
      24.095     0.999890         9776      9102.22
      25.807     0.999902         9777     10240.00
      25.807     1.000000         9777          inf
#[Mean    =        1.333, StdDeviation   =        0.912]
#[Max     =       25.792, Total count    =         9777]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9781 requests in 10.00s, 626.08KB read
  Socket errors: connect 7, read 0, write 0, timeout 28
Requests/sec:    977.85
Transfer/sec:     62.59KB