perfTest/stage5/put.txt
Running 10s test @ http://localhost:8080
  4 threads and 1024 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.71ms    1.58ms  42.21ms   96.34%
    Req/Sec       -nan      -nan   0.00      0.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.47ms
 75.000%    1.87ms
 90.000%    2.34ms
 99.000%    8.92ms
 99.900%   20.62ms
 99.990%   26.05ms
 99.999%   42.24ms
100.000%   42.24ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.210     0.000000            1         1.00
       0.860     0.100000          981         1.11
       1.016     0.200000         1955         1.25
       1.159     0.300000         2935         1.43
       1.316     0.400000         3912         1.67
       1.471     0.500000         4888         2.00
       1.541     0.550000         5378         2.22
       1.618     0.600000         5865         2.50
       1.693     0.650000         6357         2.86
       1.777     0.700000         6846         3.33
       1.866     0.750000         7333         4.00
       1.919     0.775000         7576         4.44
       1.982     0.800000         7824         5.00
       2.049     0.825000         8076         5.71
       2.127     0.850000         8310         6.67
       2.227     0.875000         8557         8.00
       2.275     0.887500         8678         8.89
       2.341     0.900000         8802        10.00
       2.403     0.912500         8921        11.43
       2.475     0.925000         9042        13.33
       2.593     0.937500         9166        16.00
       2.663     0.943750         9226        17.78
       2.773     0.950000         9288        20.00
       2.951     0.956250         9348        22.86
       3.257     0.962500         9409        26.67
       3.761     0.968750         9471        32.00
       4.067     0.971875         9501        35.56
       4.407     0.975000         9531        40.00
       4.867     0.978125         9562        45.71
       5.459     0.981250         9592        53.33
       6.259     0.984375         9623        64.00
       6.787     0.985938         9638        71.11
       7.491     0.987500         9653        80.00
       8.255     0.989062         9669        91.43
       9.159     0.990625         9684       106.67
      11.087     0.992188         9699       128.00
      11.599     0.992969         9707       142.22
      11.951     0.993750         9714       160.00
      12.351     0.994531         9722       182.86
      13.119     0.995313         9730       213.33
      13.967     0.996094         9737       256.00
      14.615     0.996484         9741       284.44
      15.207     0.996875         9745       320.00
      15.799     0.997266         9749       365.71
      16.735     0.997656         9753       426.67
      18.143     0.998047         9756       512.00
      18.623     0.998242         9758       568.89
      19.791     0.998437         9760       640.00
      20.079     0.998633         9763       731.43
      20.271     0.998828         9764       853.33
      20.703     0.999023         9766      1024.00
      20.767     0.999121         9767      1137.78
      21.471     0.999219         9768      1280.00
      22.079     0.999316         9769      1462.86
      22.223     0.999414         9770      1706.67
      23.231     0.999512         9771      2048.00
      23.231     0.999561         9771      2275.56
      23.983     0.999609         9772      2560.00
      23.983     0.999658         9772      2925.71
      25.279     0.999707         9773      3413.33
      25.279     0.999756         9773      4096.00
      25.279     0.999780         9773      4551.11
      26.047     0.999805         9774      5120.00
      26.047     0.999829         9774      5851.43
      26.047     0.999854         9774      6826.67
      26.047     0.999878         9774      8192.00
      26.047     0.999890         9774      9102.22
      42.239     0.999902         9775     10240.00
      42.239     1.000000         9775          inf
#[Mean    =        1.707, StdDeviation   =        1.584]
#[Max     =       42.208, Total count    =         9775]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  9779 requests in 10.00s, 639.84KB read
  Socket errors: connect 7, read 0, write 0, timeout 28
Requests/sec:    977.79
Transfer/sec:     63.98KB